app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams"  WHERE (is_personal != true)
---
  def index
    @teams = Team.all

SELECT  "teams".* FROM "teams"  WHERE "teams"."id" = $1 LIMIT 1  [["id", 1]]
---
  def load_team
    @team = Team.find(params[:id])